[
  {
    "date": "2023-06",
    "displayDate": "June 2023",
    "title": "Weather Eye",
    "image": "images/moon_riding_rainbow_IMG_0876_1000x750.jpg",
    "caption": "Moon riding a rainbow!",
    "content": "Everything is growing here in the highland rim of northern Tennessee! This spring and summer have had pleasantly-cool weather, with plenty of rain. In June we had our first hint of dryer and hotter weather, but rain appeared just as the lawn grass started turning yellowish in places. This was made worse by the arrival of smoke from the widespread wildfires in Canada. For us, views across the valley and into the distant mountains have had a definite hazy cast. But it has been nothing like the oppressively-thick orange-tinted smoke in places like NYC."
  },
  {
    "date": "2023-06",
    "displayDate": "June 2023",
    "title": "Chicks to Chickens",
    "image": "images/rooster_and_hens_IMG_0730_1000x750.jpg",
    "caption": "Our Chickens!",
    "content": "The chicks now look more like miniature chickens than chicks, and they are feathering out nicely. They mainly just hang out, but it is not uncommon for them to face off or chase each other as they establish their pecking order. They are eating and drinking MUCH more than when they were little, and we switched from “chick-size” waterers/feeders to those for full-grown chickens. Don’t forget to sign up for your egg subscription — this is your chance for real pastured-poultry eggs."
  },
  {
    "date": "2023-06",
    "displayDate": "June 2023",
    "title": "Guard Puppies!",
    "image": "images/dogs_dashing_play_IMG_0857_1732x800.PNG",
    "caption": "Our Great Pyrennes Guard Dogs!",
    "content": "Speaking of growing, the Great Pyrenees guard dog puppies are HUGE! The male, “Strider”, is about 70 pounds, and the female, “Eowyn” (she goes by “Wynnie”), is about 60 pounds. Strider is more laid-back, a lovable big-boned lunk with soulful eyes. Wynnie is super intelligent, lithe, strong-willed, and curious about everything! She sniffs every plant leaf and checks out every bug. They make a great pair and love being together."
  }
]